<?php

namespace Database\Seeders;

use App\Models\Course;
use Illuminate\Database\Seeder;


class CourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Course::create([
            'name' => 'تصميم الويب',
            'slug' => 'ويب',
            'description' => 'صممت هذة الدورة لتمكين الفرد من تصميم و نشر صفحات الانترنت سواء كانت مواقع شخصية او المواقع الخاصة بالمؤسسات و الشركات حيث تمكن المنتسب من التعامل مع العديد من الوسائل و البرامج الخاصة بتصميم صفحات الانترنت من خلال البرامج الاتية
Html - CSS - JavaScript - Dreamweaver - Photoshop for web ',
            'status' => '1',
            'department_id' => '1',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);

        Course::create([
            'name' => 'برمجة تطبيقات اندرويد',
            'slug' => 'اندرويد',
            'description' => 'ستتعلم في هذا المساق
فهم أساسيات مفاهيم البرمجة باستخدام الـ Object-Oriented.
استخدام نهج برمجة الـ Object-Oriented في تطوير البرمجيات باستخدام الـ Java.
إنشاء برامج بسيطة من لغة برمجة الجافا.
فهم أساسيات برمجة التطبيقات الذكية باستخدام الـ Android.
تصميم واجهات المستخدم بأحدث الطرق البرمجية لضمان تصاميم عصرية وسهلة الاستخدام.
برمجة الآليات التي تضمن عمل التطبيق بكفاءة وبدون أخطاء.
اختبار التطبيق والتأكد من جاهزيته للرفع على الـ Google Play.
عمل تطبيق كامل متكامل على نظام الاندرويد.',
            'status' => '1',
            'department_id' => '1',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);

        Course::create([
            'name' => 'تصميم المنشآت الحديثة',
            'slug' => 'عمارة-تصميم',
            'description' => '70',
            'status' => '1',
            'department_id' => '2',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);


        Course::create([
            'name' => 'Sketch up',
            'slug' => 'عمارة',
            'description' => 'مخرجات الدورة
تعلم كيفية رسم المخططات ثلاثية الأبعاد باستخدام برنامج السكتش أب وكذلك تعلم إضافة المواد والإشعاع والحيوية.
تمكين المشاركين من رسم وتصميم المخططات المعمارية او الداخلية بكامل ابعادها وتفاصيلها مع المقاطع والمشاهد ثلاثيه وثنائيه الأبعاد بطرق سهلة وسريعة.
تمكين المشاركين من رسم التفاصيل الداخلية مثل المطابخ والأثاث الداخلي بطرق احترافية.
تمكين المشاركين من إخراج إظهار داخلي وخارجي v-ray.
',
            'status' => '1',
            'department_id' => '2',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);


        Course::create([
            'name' => 'التحليل الإنشائي ثلاثي الأبعاد',
            'slug' => 'أرض وبيئة',
            'description' => 'مقدمة تشمل المفاهيم الاساسية (الجمل الاحداثية - درجات الحرية - طريقة العناصر المحددة - الحمولات – عملية النمذجة)
التعرف على أدوات وأوامر البرنامج من خلال شرح القوائم المهمة
نمذجة وتحليل لمدة بسيطة وأخرى مستمرة بأحمال ودعائم مختلفة continuous Beams
نمذجة وتحليل اطار خرساني ثنائي الابعاد بأحمال ومقاطع متغيرة Fram  2D
نمذجة وتحليل اطار خرساني ثلاثي الابعاد بأحمال ومقاطع مختلفة Frame 3D
نمذجة وتحليل جمالون معدني بأحمال ومقاطع مختلفة Trusse 2D
نمذجة وتحليل بلاطة مصمتة باتجاه واحد واتجاهين Solid Slab
نمذجة وتحليل قوس دائري (حزام دائري) Curved beam
نمذجة وتحليل لبشة خرسانيةRaft Foundation
نمذجة وتحليل بلاطة هوردي Ribbed Slab',
            'status' => '1',
            'department_id' => '3',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);


        Course::create([
            'name' => 'GIS',
            'slug' => 'GIS',
            'description' => 'التعريف بنظم المعلومات الجغرافية بشكل عام.
تعريف المشاركين بآخر اصدارات شركة إزري.
معرفة استخدامات وأهمية نظم المعلومات الجغرافية في حياتنا العملية.
تعلم كيفية بناء قواعد البيانات المكانية ذات الأهمية الكبيرة في نظم المعلومات الجغرافية.
تعلم كيفية بناء الأنظمة ثلاثية الأبعاد و ربطها بنظم المعلومات الجغرافية.',
            'status' => '1',
            'department_id' => '3',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);


        Course::create([
            'name' => 'تركيب الخلايا الشمسية',
            'slug' => 'كهرباء-خلايا',
            'description' => 'تعرف الطاقة الشمسية {الخلايا الكهروضوئية} هي وسيلة لتوليد الطاقة الكهربائية عن طريق تحويل الإشعاع الشمسي إلى كهرباء مباشرة باستخدام أشباه موصلات تحمل أثر الضوئية، والخلايا الكهروضوئية تستخدم الألواح الشمسية والتي تتكون من عدد من الخلايا الشمسية والتي تحتوي على مواد ضوئية.
والمواد الضوئية المستخدمة لتكوين الخلايا الضوئية تشمل السيليكون أحادي البلورة، السليكون متعدد البلورة، السيليكون غير المتبلور, تلوريد الكادميوم، الانديوم سيلينيد الغاليوم- كبريتيد،1 ونظراً للطلب المتزايد على مصادر الطاقة المتجددة، فإن تصنيع الخلايا الشمسية والخلايا الكهروضوئية قد تطور كثيراً في السنوات الأخيرة.

والخلايا الكهروضوئية تشهد نمواً سريعاً، من قاعدة صغيرة إلى قدرة عالمية سعتها 46400 ميغاواط في نهاية عام 2011 وهو ما يمثل 0.5% من الطلب العالمي على الكهرباء وأكثر من 100 بلد تستخدم الطاقة الشمسية الكهروضوئية، وتركيب الخلايا إما أن يكون أرضي (يتم دمجها في بعض الأحيان مع الزراعة أو الرعي) أو تبنى في سقف أو جدران المبنى {بناء متكامل مع الخلايا الكهروضوئية}.

وانخفضت تكلفة الطاقة الشمسية بشكل مطرد منذ أن تم تصنيعها لأول مرة، ومستوى تكلفة الكهرباء للخلايا الكهروضوئية قادرة على المنافسة مع مصادر الكهرباء التقليدية على مستوى التوسع في المناطق الجغرافية، وهناك سياسة من شركة الكهرباء بحيث يتم إرسال فاتورة خاصة للمستهلكين الذين يستخدمون مصادر الطاقة المتجدة في بعض مناطق العالم.

أهداف الدورة التدريبية:
في نهاية الدورة سيكون المشاركون قادرين على:
التعرف على الاهتمامات الاستراتيجية والإدارية.
 التعرف على التقنيات المستخدمة في هذا المجال.
معرفة القضايا الفنية في التنفيذ.
معرفة الجوانب التنظيمية والتعاقدية.
التعرف على عمليات العمل.
معرفة المعايير المهنية.
التعرف على منهجية ضمان الجودة.',
            'status' => '1',
            'department_id' => '4',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);


        Course::create([
            'name' => 'التمديات الكهربائية والأمان في العمل',
            'slug' => 'أمان-كهربائ',
            'description' => 'سيتمكن المشارك من التميز في:

الاستراتيجيات الاساسية للأوشا OSHA
تحديد وتقييم المخاطر فى المنشآت الصناعية واستراتيجيات إدارة المخاطر
تكنولوجيا  السلامة والصحة المهنية  فى بيئة العمل
اسباب حوادث الكهرباء ، واساليب التحكم والسيطرة
الاساليب العلمية الحديثة للحد من الخسائر  فى المنشآت  نتيجة حوادث الكهرباء معايير OSHA
الاستراتيجيات التدريجية للتحكم فى المخاطر (هرم هيراركي)...
التحكم الهندسي والتحكم الادارى فى بيئة العمل المثالية
مستويات الطوارئ فى المنشآت ، والتخطيط للطوارئ وحالات الاخلاء والانقاذ
افضل ممارسات الاشراف والتحكم الهندسى والادارى فى مخاطر السلامة والصحة المهنيةٍ
معايير البيئة الصتاعية المثالية
 ',
            'status' => '1',
            'department_id' => '4',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);

        Course::create([
            'name' => 'الجودة الصناعية في قطاع الصناعات الدوائية',
            'slug' => 'صناعة-أدوية',
            'description' => 'الهدف الأساسي من CESIF هو تدريب المهنيين مع مستوى عال من الخبرة في مختلف الوظائف الفنية والإدارية التي تقدمها الشركات، استكمالا للمناطق التعليمية مع إعداد شامل وشخصي للبحث.
            وسيحصل كل طالب بتنفيذ النشاط العملي المختلفة ذات الصلة إلى المجالات الرئيسية للدورة التي سيتم تقييمها في وقت لاحق من قبل إدارة البرنامج.

برنامج المحتويات

برنامج الخبير الصناعي في الجودة الدوائية، وينقسم إلى 5 كتل لتشمل جميع الجوانب اللازمة لتشكيل التلميذ.

الإطار التنظيمي

الأسواق المتكاملة، اتفاقيات الاعتراف المتبادل والعرض العالمي.
أنظمة الجودة في قطاع الصناعات الدوائية. المركب / FDA، ISPE ICH. ISO 9001. التحديات الراهنة وتنسيق الأطر التنظيمية. الولايات المتحدة المركب / FDA، ISPE ICH. ISO 9001.
دور الجودة في شركة أدوية. منذ تطوير أو شراء منتج (العناية الواجبة) إلى وقف. إدارة دورة حياة من منظور الجودة. هيكل عرضية.
أنواع المختبرات الدوائية.
ENVIRONMENTS ضمان الجودة في الإنتاج: مراقبة الجودة

وظائف، وتنظيم مراقبة الجودة في المختبرات. إشارات إلى اللوائح.
معدات المختبرات التأهيل والتحقق من الأساليب التحليلية.
الدراسات الاستقرار.
تنظيف التصديقات لاستكمال عملية التحقق من الصحة.
            ',
            'status' => '1',
            'department_id' => '5',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);

        Course::create([
            'name' => 'تصنيع المواد الغذائية والمعلبات',
            'slug' => 'صناعة-معدات',
            'description' => 'تهدف دورة تصنيع الاغذية والتخزين الغذائي الى اعطاء الطرق السليمة في طريقة تصنيع الاغذية كالمربيات والمخللات وغيرها واعطاء الطريقة المناسبة في الطبخ لابقائها لاطول فترة ممكنة بالاضافة الى الطرق السليمة في تخزين الخضار والمواد الغذائية الاخري للحفاظ على القيمة الغذائية فيها مما يوفر ويسهل على ربة البيت الحصول على اي نوع غذائي باي وقت من اوقات السنة وقد تم عمل الكثير من المربيات كمربى العنب وكيفية حفظه لاطول فترة ممكنة',
            'status' => '1',
            'department_id' => '5',
            'trainer_id'=>'1',
            'cost'=>'70',
            'hours'=>'30',
        ]);
    }
}
