<?php

namespace Database\Seeders;

use App\Models\Department;
use Illuminate\Database\Seeder;

class DepartmentsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //حاسوب
        Department::create([
            'name' => 'هندسة الحاسوب',
            'slug' => 'حاسوب',
            //'image' => 'a.jpg',
            'definition' => 'يعرف تخصص " هندسة الحاسوب " أو ما يطلق عليه باللغة الإنجليزية Computer Engineering " أنه فرعا من فروع التخصصات الهندسية والذي يجمع بين دراسات وحقول علمية مختلفة من تخصصي علم الحاسوب وهندسة الكهرباء والاتصالات بهدف بناء أجهزة الحاسوب وبرمجياته والتي يطلق عليها Hardware و Software .',
            'qualities' => 'ربما أنت تتساءل الآن ، ما هي المؤهلات العلمية والصفات الشخصية والمهارات العملية التي تخولني لدراسة تخصص هندسة الحاسوب . ومن الجدير بالذكر أنه على رواد تخصصات علم الحاسوب بشكل عام التفكير بصورة جيدة بنّاءة مجدية وهادفة لذا تعرف على المفاتيح الرئيسية لارتياد تخصص هندسة الحاسوب :
المؤهلات العلمية :
80 % الحد الأدنى لمعدل الثانوية العامة
الالتحاق بالمسار العلمي أو الصناعي في الثانوية العامة
مستوى جيد في اللغة الإنجليزية
مستوى جيد في الرياضيات والتكنولوجيا والهندسة
الصفات الشخصية :
الصفات الشخصية
مهارات حل المشاكل
المهارات التحليلية .
الإبداع والابتكار.
القدرة على التعامل مع الأجهزة الإلكترونية الدقيقة.
لقدرة على تبسيط الأمور المعقدة وشرحها .
تجنب الوقوع في الخطأ .
التعلم الذاتي والتعلم المستمر ومواكبة التكنولوجيا والتحديثات المستمرة .',
            'advantages' => 'صعوبة التخصص نوعا ما .
شدة التنافس بين طلبة التخصص
الدراسة لسنوات كثيرة والحاجة إلى التعلم بشكل مستمر .
يمكن اعتباره من أحد التخصصات التي تتحدى العقل ۔',
            'disadvantages' => 'صعوبة التخصص نوعا ما .
شدة التنافس بين طلبة التخصص
الدراسة لسنوات كثيرة والحاجة إلى التعلم بشكل مستمر .
يمكن اعتباره من أحد التخصصات التي تتحدى العقل ۔',
            'workfields' => 'مطور برامج
مصم ألعاب الكمبيوتر
مهندس برمجيات
مدير المشاريع المتعلقة بتكنولوجيا المعلومات
مبرمج
الدعم الفني
مهندس كمبيوتر',
            'status' => '1',
        ]);

        //عمارة
        Department::create([
            'name' => 'الهندسة المعمارية',
            'slug' => 'عمارة',
            //'image' => 'a.jpg',
            'definition' => 'لا تعرف " هندسة العمارة " أو " الهندسة المعمارية " أو بالإنجليزية " Architecture " بأنها علم فقط ، بل هي شقف ، وإبداع ، وموهبة وعمل بالإضافة إلى أنها فن ؛ فهي فن التصميم ، تعتبر هندسة العمارة فرعا من قسم الفنون والتصميم كما أنها فرعا من فروع الهندسة أو نوعا منها . حيث يختص كل نوع من أنواع الهندسة بجانب معين وتختص هندسة العمارة بجوانب البناء والتصميم والإنشاء ويقصد بعلم هندسة العمارة أنه علم تشييد وتصميم المباني من أجل أن يغطي بها الإنسان احتياجاته المادية ، مثل السكن . أو الاحتياجات المعنوية مثل الأمن والأمان حيث يتم ذلك باستخدام المواد البنائية والأساليب الإنشائية المناسبة . والتخصص ذات علاقة وثيقة أيضا بتصميم المدن ، والتخطيط العمراني . تختص هندسة العمارة بالشكل الكلي للعمارة وتهدف إلى المحافظة على أمان البناء وخلقه من الأخطار . كما يبدأ عمل المهندس المعماري بتخيل شكل التصميم ومن ثم ترجمته على أرض الواقع . وتشمل هندسة العمارة العمارة الأمور التالية :
 البناء
التشييد
التكييف
التصميم
الإضاءة
الإنشاءات
التوصيلات الكهربائية
التصميم باستخدام الحاسوب
كما وتشمل هندسة العمارة إصلاح المباني القديمة وصيانة التراث المعماري .
',
            'qualities' => 'من أهم المهارات التي لا بد أن رواد تخصص هندسة العمارة : مهارات تحليلية : يحلل المهندسين محتوى التصميم ، وعناصره وكل ما يتعلق به لذا عليهم فهم خصائص المواقع التي يقيمون المشاريع فيها فها تاقا وفيما إذا كان هذا الموقع قناسبا لهذا المشروع أم لا . مهارات التواصل : لا يستطيع المهندس أو المهندسة شرح فكرة مشاريعهم والخطط التي يعتمدونها للعملاء أو المهندسين آخرين ، إلا إذا كانوا يتحلون بمهارات تواصل عالية .
مهارات تنظيمية وإدارية : وذلك لضمان وجود كل الوثائق ، والمشاريع وجميع المعلومات التي تتعلق بهم . مهارات تقنية : يستخدم مهندسين العمارة تطبيقات الحاسوب في عملهم ، فيجب أن تكون لديهم المهارات التكنولوجية . لا تقلق لو لم تكن تتوافر لديك هذه المهارات فيمكن اكتسابها مع التعليم والممارسة والوقت لكن ما يجب توافره في شخصيتك هو بعض الأمور التالية ، حيث يجب على المهندس أن يكون :
مفكر جيد
واسع الخيال
متحمس ويتقبل التدّد
و محبا للفنون
موهوب ومبدع
محبا للعمل الميداني
لديه حس المسؤولية
يتقن مهارة التخطيط
منفتح للحياة وعملي
يعمل بروح الفريق الواحد
دقيق ويهتم في التفاصيل !
قادر على التعامل مع المشاكل
يمتلك مهارات شخصية ومهارات تواصل جيدة
على معرفة جيدة بالرياضيات والكيمياء والفيزياء
يمتلك ذوق فريد
أن يكون منفتحا ويتقبل الآراء والنقد في الوقت ذاته القدرة على الرسم الحر
الإلمام ببرامج الرسم على الكمبيوتر
احترافية في التعامل مع الناس
التميز العلمي
القدرة على ابتكار تصاميم حديثة والإتيان بأفكار جديدة
المعرفة الجغرافية لموقع الورشات مع معرفة شاملة وعامة عن الحالة الجوية والمناخية
القدرة على كتابة الأبحاث والتقارير
لو كنت تتمتع بكل هذه الصفات واهتماماتك بعيدة عن الرياضة من المؤكد أن تخصص هندسة العمارة من التخصصات التي تناسبك . لكن في حال عدم توافر هذه الصفات تستطيع العثور عن تخصصات أخرى قد تناسبك بشكل أكبر مثل تخصص إدارة الأعمال ، أو علم الحاسوب أو اللغات مثلا
',
            'advantages' => 'القدرة على كسب رواتب عالية جدا
امكانية امتلاك المشاريع الخاصة وتشغيلها
اكتساب الخبرة بسرعة

بعض المهارات التي يكتسبها خريج هندسة العمارة : يكتسب الطلبة بعد التخرج ما يلي من الصفات والمهارات :
اكتساب الحس الفني ، و الجمالي ، والإبداعي
يتخرج الطلبة وهم على ثقافة كبيرة فيما يخص الحضارات وتاريخ العمارة
اكتساب مهارات فيزيائية وهندسية يمكنهم الاستفادة منها في حياتهم العملية والعلمية
اكتساب مهارات التفكير النقدي ، والتفكير البنّاء عن طريق الحكم على المشاريع والتصاميم
اكتساب مهارة العمل الجماعي ، وبروح الفريق الواحد لأن أساتذة الجامعات غالبا ما يقومون بتقسيم الطلبة إلى مجموعات وتسليم كل مجموعة مشروع وهذا من شأنه أن ينمي روح الفريق لدى الطلبة
',
            'disadvantages' => '
الانتباه والتركيز على أدق التفاصيل
العمل لساعات طويلة
العمل الميداني والذهاب إلى الورشات
أحيانا يصعب إقناع الزبون بالقيم والجوانب الجمالية وذلك بسبب تعدد الأذواق
',
            'workfields' => '
الانتباه والتركيز على أدق التفاصيل
العمل لساعات طويلة
العمل الميداني والذهاب إلى الورشات
أحيانا يصعب إقناع الزبون بالقيم والجوانب الجمالية وذلك بسبب تعدد الأذواق
',
            'status' => '1',
        ]);

        //مدني
        Department::create([
            'name' => 'الهندسة المدنية',
            'slug' => 'مدني',
            //'image' => 'a.jpg',
            'definition' => 'يعرف " علم الهندسة " أو بالإنجليزية " Engineering " أنه تطبيق القواعد والقوانين العلمية على أرض الواقع بهدف تلبية احتياجات الإنسان ، وابتكار الاختراعات العلمية التي من شأنها أن تساعد الناس في حل مشاكلهم ، بالإضافة إلى تسهيل حياتهم . تعود نشأة تاريخ الهندسة إلى وجود البشرية ، وقد تاريخ الهندسة جزءا من تاريخ البشرية ، فهي علم قديم جدا ، وتعتبر الأهرامات في مصر وبرج إيفل في فرنسا من أكبر الأدلة على ذلك . على الرغم من عراقة علم الهندسة إلا أنه لم يكن علقا مبنيا على نظريات ومعارف علمية , بل كان مبنيا على التجربة والخطأ . ويعتمد علم الهندسة بطبيعته على المواد العلمية الأساسية المتمثلة فيما يلي :
العلوم
الفيزياء
الأحياء
الكيمياء
الرياضيات
ومن الجدير بالذكر أن الهندسة المدنية هي إحدى أهم فروع الهندسة وتعرف " الهندسة المدنية " أو ما يطلق عليه باللغة الإنجليزية " Civil Engineering " أنها الدراسة الهندسية المختصة بدراسة وتصميم المشاريع والبنى التحتية التي تشتمل على السكك الحديدية ، والأنفاق ، والجسور والطرق ، والمباني ، وشبكات المياه .
',
            'qualities' => 'العمل الجماعي والتعاون مع فريق العمل
مهارات العمل المكتبي
حب العمل الميداني
إجراء الدراسات على الأعمال الفنية وتحليلها
تقييم الأداء
الديمومة على تقديم التقارير الدورية .
المهارات العامة
مهارات التواصل الفعال .
مهارات استخدام الحاسوب .
الكفاءة في اللغة الإنجليزية .
إدارة الوقت .
التعليم الذاتي والمستمر
مهارات الإشراف والتنسيق .
المهارات الخاصة
مهارات تحليلية .
مهارات التفكير المنطقي
مهارات تقنية
اتباع قواعد السلامة العامة
شرح الرسومات والمخططات وإجراء التعديلات عليها .
الاهتمام بأدق التفاصيل
. مهارات ال STEM وهي مهارات العلوم والتكنولوجيا والهندسة والرياضيات .
الرد على الاقتراحات والشكاوي العامة
',
            'advantages' => '
1. توافر نقابة للمهندسين بعد تخرجهم .
2. تعتبر مجالات عمل التخصص واسعة جدا
3. ارتفاع الرواتب في مجال الهندسة المدنية بعد انقضاء مدة طويلة .
4. ارتفاع فرص العمل كثيرا بعد حصول المهندس على درجة الماجستير .
5. ازدياد الطلب على التخصص خاصة في سوق العمل الخليجي .
',
            'disadvantages' => '
1. شدة التنافس
2. عدم التوظيف في مجال الهندسة المدنية إلا بعد الحصول على خبرة عملية أو تدريبية
3. اعتقاد الكثير من الناس أن الهندسة المدنية هي أسهل أنواع الهندسة ، وفي الحقيقة تحتاج جميع التخصصات إلى العمل والمثابرة والعلم والاجتهاد
4. حاجة التخصص إلى الدقة الشديدة في الالتزام بالمواعيد النهائية لتسليم المشاريع التزاما شديدا .
5. التعب والإرهاق ، وضغط العمل .
',
            'workfields' => 'يمكن لمن حصل على درجة البكالوريوس في تخصص الهندسة المدنية العمل في ما يلي من قائمة الوظائف والوجهات التي أعدتها منصة فرصة لكم :
رئيس قسم هندسة مدنية .
مهندس مدني عام .
المؤسسات العلمية والبحثية .
مشرف هندسة مدنية .
مهندس مدني مصمم .
رئيس شعبة هندسة مدنية .
خدمات الهندسة المدنية بكل أنواعها .
شركات المقاولات .
البنوك العقارية .
المكاتب العقارية.
شركات الاستشارة الهندسية.
مختبرات البيئة والمياه.
',
            'status' => '1',
        ]);

        //كهرباء
        Department::create([
            'name' => 'الهندسة الكهربائية',
            'slug' => 'كهرباء',
            //'image' => 'a.jpg',
            'definition' =>'يتخرج أصحاب هذا التخصص وهم على دراية تامة بالمعرفة التكنولوجية التي تتعلق بأنظمة الاتصالات المختلفة والمتنوعة مع الأخذ بعين الاعتبار الانتشار الهائل والواسع لتطبيقات الحاسوب في أنظمة الاتصالات والبرمجيات لأجهزة الاتصال السلكية واللاسلكية بالإضافة إلى الشبكات الضوئية والاتصالات الكهربائية والالكترونية ، والمحطات الكهربائية والحواسيب والآلات .
Electrical " يولي تخصص " هندسة الكهرباء والاتصالات " أو ما يطلق عليه باللغة الإنجليزية Engineering and Communications " الأهمية العظمى إلى تخريج كوادر فنية متخصصة في مجالات التخصص سواء كانت عملية أم نظرية من أجل صيانة وإنشاء وتصميم تطبيقات الحاسوب في أنظمة الاتصالات والبرمجيات
',
            'qualities' => ' مهارات إدارية
إدارة الوقت .
القدرة على الإبداع والابتكار .
مهارات تواصل جيدة مع الآخرين .
مستوى جيد في المهارات التحليلية .
العمل بروح الفريق الواحد والعمل الجماعي .
إجادة حلول لمختلف المشاكل
مهارات الشخصية القيادية
المؤهلات والمهارات الخاصة :
مستوى عالي في مجال الخبرة التقنية
وضع الأهداف .
مهارات العمل المكتبي .
مهارات العمل الميداني.
إجادة اللغة الإنجليزية .
مهارات استخدام الحاسوب .
مهارات التخطيط والتنفيذ .
المراقبة والتقييم .
مهارات ال STEM , وهي اختصار لأربع كلمات تشير إلى مهارات العلوم والتكنولوجيا والهندسة ، والرياضيات .
التعامل مع البيانات والأرقام .
الإلمام بقواعد وأساسيات السلامة العامة .
مراعاة أخلاقيات العمل المهني .
لا تقلق لو كنت تود دراسة هذا التخصص وتفتقر بعض الصفات والمؤهلات , لأني ما عليك إلا العمل بجد من أجل اكتسابها وممارستها
.',
            'advantages' => '
1. إمكانية الانتساب إلى الجمعيات والنقابات ووجود نقابة للمهندسين
2. اكتساب مهارات حل المشكلات .
3. استخدام التكنولوجيا وتوظيفها فيما يعود بالفائدة والنفع على المجتمعات .
4. يؤدي الانفتاح العالمي التكنولوجي والعلمي إلى توسيع آفاق العمل وزيادة عدد الوظائف في المجال .
',
            'disadvantages' => '
1. تراكم العبء الإضافي على أصحاب هذا التخصص ورواده نظرا للتطورات المتسارعة والمستمرة التي يشهدها قطاعي الكهرباء والاتصالات
2. التنافس الشديد على شغل الوظائف في السوق العمل .
3. الحاجة الماسة إلى اتباع قواعد الأمن والسلامة وتوخي الحيطة والحذر من أجل تجنب الإصابات
4. تعرض مهندسي الكهرباء والاتصالات إلى التعب والإرهاق وذلك بسبب بذل جهود مكثفة .
',
            'workfields' => '
يمكن لمهندسي الكهرباء والاتصالات العمل في القطاعين العام والخاص . وبصورة عامة تقتصر مهام عملهم على اختبار الآلات الكهربائية وصيانتها ، فضلا عن التعديل عليها ، والتعديل على الأنظمة التشغيلية ومعدات التحكم الكهربائية كما يستطيع خريجي هذا التخصص العمل في الوجهات والقطاعات وشغل المناصب التالية :
فني هندسة كهربائية
فني هندسة اتصالات
جميع أنواع المصانع
المراكز البحثية
شركات ومصانع الإلكترونيات
شركات الاستشارات الهندسية
شركات الاتصالات المختبرات العلمية
مجالات الطاقة البديلة والطاقة المتجددة
محطات توليد الكهرباء
شركات المقاولات
الخدمات الميكانيكية للمباني مثل التمديدات الصحية  التصميم الميكانيكي لآلات وخطوط الإنتاج
مجالات الاتصال الحديثة وأجهزة الإرسال والاستقبال والألياف الضوئية
مجالات صناعة السيارات وصيانتها وقطع السيارات
',
            'status' => '1',
        ]);

        //صناعي
        Department::create([
            'name' => 'الهندسة الصناعية',
            'slug' => 'صناعة',
            //'image' => 'a.jpg',
            'definition' => '
إن الهندسة بشكل عام هي تطبيق القواعد والقوانين العلمية على أرض الواقع ، بهدف تلبية احتياجات الإنسان ، ومن أجل ابتكار الاختراعات العلمية التي التي من شأنها أن تساعد الناس في حل مشاكلهم بالإضافة إلى تسهيل حياتهم . وتكون التخصصات الهندسية موزعة حسب اهتمامات واختصاص كل فرع . على سبيل المثال . هناك الهندسة الكيميائية والصناعية ، والفيزيائية والميكانيكية والطبية والمزيد من التخصصات الهندسية التي تضيف الطابع الهندسي إلى العلوم وتهتم " الهندسة الصناعية " أو ما يطلق عليها باللغة الإنجليزية" Engineering Industrial"
بتصميم وتطوير وإدارة الأنظمة القائمة على الموارد البشرية والمواد والمعلومات والآلات والطاقة . ويعتمد تخصص الهندسة الصناعية على علم الرياضيات والفيزياء والعلوم الإنسانية بالإضافة إلى المبادئ والتحليلات الهندسية من أجل تحديد مخرجات الأنظمة .
',
            'qualities' => '
الإلمام بأخلاقيات العمل المهني .
المعرفة بمعايير ضبط الجودة .
إدارة الوقت ودراسته بالشكل الصحيح .
القدرة على تحديد نقاط القوة ونقاط الضعف .
مهارات استخدام الحاسوب .
مهارات التواصل الفعال .
الإنتاجية .
مهارات العمل الميداني .
مهارات العمل المكتبي .
مهارات إتقان اللغة الإنجليزية .
مهارات اتخاذ القرارات بشكل سريع ومناسب .
مهارات خاصة بالهندسة الصناعية :
صفات الشخصية القيادية
الاهتمام بأدق التفاصيل .
كتابة وإعداد التقارير الدورية اللازمة
القدرة على الموازنة بين الخبرات التقنية والمهارات الإدارية .
مهارات ال STEM وهي مهارات العلوم والتكنولوجيا والهندسة والرياضيات .
المؤهلات العلمية:
أن يكون الحد الأدني لمعدل الثانوية العامة لا يقل عن 80 % في الجامعات الخاصة بينما ينبغي ألا يقل عن 90 % .
أن يكون الطلاب والطالبات قد التحقوا بالمسار العلمي أو الصناعي في الثانوية العامة .
',
            'advantages' => '
1. يعد القطاع الصناعي مجالا واسعا وكبير النمو .
2. إمكانية انتساب مهندسي الصناعة إلى نقابة المهندسين .
3. تصاعد الحاجة إلى أجيال متخرجة من تخصص الهندسية الصناعية في ظل تعقيد المنظمات الصناعية والخدمات الحديثة .
4. تلعب الصناعة دورا كبيرا في التأكيد على جودة الخدمات والمنتجات بالإضافة إلى زيادة الفاعلية والإنتاجية .
',
            'disadvantages' => '
1. معاناة سوق العمل من الإشباع .
2. اعتقاد البعض أنه تخصصا ذكوريا .
3. صعوبة تحقيق النجاح في التخصص دون امتلاك صفات الشخصية القيادية
4. الحاجة الماسة إلى اتباع قواعد الأمن والسلامة وتوخي الحيطة والحذر من أجل تجنب الإصابات .
',
            'workfields' => '
يستطيع من حصل على درجة البكالوريوس في تخصص الهندسة الصناعية شغل الوظائف التالية :
مهندس صناعي - Industrial Engineer
مهندس تصنيع –
Manufacturing Engineer
مهندس ضبط جودة - Quality Engineer
مهندس عمليات - Process Engineer
وتكون وظائف الهندسة الصناعية في ما يلي من المجالات :
المصانع ، حيث يمكن العمل في مجال الإدارة الهندسية وضبط الجودة والصيانة ، ومن الممكن أن يكون العمل في جميع أنواع المصانع سواء كان مصنع أغذية أم مصنع السيارات وقطع غيار
المدارس : فمن الممكن تدريس مادة الرياضيات أو الفيزياء
المؤسسات التعليمية والمراكز والشركات بجميع أنواعها حيث يمكن الإشراف على الأعمال الهندسية وأعمال الصيانة فيها
تصنيع الآلات الزراعية
إدارة الطاقة والأنظمة الصحية والمنشآت الصناعية
',
            'status' => '1',
        ]);
    }
}
