<?php

namespace Database\Seeders;

use App\Models\Scholarship;
use Illuminate\Database\Seeder;


class scholarshipsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Scholarship::create([
            'name' => 'منحة الامتياز',
            'slug' => 'امتياز',
            'percent' => '70',
            'status' => '1',
            'internal' => '1',
            'description' => 'أن يحصل الطالب على معدل فصلي 95% كحد أدنى في الفصل السابق لفصل الاستفادة من المنحة.
أن يكون الطالب مجتازاً بنجاح 15 ساعة معتمدة كحد أدنى للفصل السابق لفصل الاستفادة من المنحة إذا كان المعدل الفصلي من 95% إلى 100%
أما إذاكلن الطالب حاصل على معدل فصلي بنسبة 90% إلى 95% فإنه يحصل على منحة دراسية بنسبة 35% بشرط:
1- أن يحصل الطالب على معدل فصلي ما بين (90 - أقل من 95%) كحد أدنى في الفصل السابق لفصل الاستفادة من المنحة، ويجتاز 15 ساعة معتمدة على الأقل في الفصل السابق.
2- إذا حصل الطالب على معدل امتياز ثم دخل برقم جديد لا تنقل منحة الامتياز إلى رقمه الجديد.
3- إذا حصل الطالب على معدل امتياز ثم حول إلى كلية/قسم آخر على نفس الرقم يبقى من حقه الاستفادة من المنحة كما هي شريطة أن يعادل له 12 ساعة معتمدة على الأقل
4- لا يتم تفعيل منحة الامتياز لطلبة الطب على الفصل الفصل الصيفي عند حصولهم على معدل امتياز في الفصل الثاني."."

',
        ]);

        Scholarship::create([
            'name' => 'منحة الجامعة المقدمة لوزارة التربية والتعليم العالي',
            'slug' => 'وزارة التربية والتعليم',
            'percent' => '70',
            'status' => '1',
            'internal' => '1',
            'description' =>'1- يتم اختيار الطلبة من قبل وزارة التربية والتعليم العالي حيث يتم اختيار أعلى طالبين مسجلين في كل كلية (حسب معدل الثانوية العامة) باستثناء طلبة كلية الطب.
2- يوقف صرف المنحة بشكل نهائي إذا حول الطالب إلى كلية أخرى أو رسب في (6) ساعات معتمدة خلال العام الدراسي."
بشرط أن يكون المعدل الفصلي لاستمرار المنحة 80%',
        ]);

        Scholarship::create([
            'name' => 'منحة حفظة القرآن الكريم',
            'slug' => 'القرآن الكريم',
            'percent' => '50',
            'status' => '1',
            'internal' => '1',
            'description' => '* التسميع مرة واحدة خلال العام الدراسي الواحد.
* يحصل على المنحة الطالب الناجح في امتحان التسميع لكامل القرآن"
بشرط أن يكون المعدل الفصلي 80% لاستمرار المنحة'
            ]);
        Scholarship::create([
            'name' => 'المنحة الأزهرية',
            'slug' => 'الأزهرية',
            'percent' => '70',
            'status' => '1',
            'internal' => '1',
            'description' => '"* أن يرد اسم الطالب في الكشف الرسمي (دور أول، دور ثاني، استبدال) المرسل من عميد المعهد الديني ""الأزهر""
* أن يكون معدل الطالب في الثانوية العامة يؤهله للقبول في الجامعة.
* أن لا تكون شهادة الثانوية العامة قد مضى عليها أكثر من عامين."

بشرط أن يكون المعدل الفصلي 70%'
        ]);
        Scholarship::create([
            'name' => 'منحة الأسرة (فردين)',
            'slug' => 'الأسرة فردين',
            'percent' => '15',
            'status' => '1',
            'internal' => '1',
            'description' => '" تشمل المنحة الطلبة الذين يحملون أرقاماً جامعية (2017) وما بعدها.
* تشمل المنحة الطلبة المنتظمين بالجامعة الاسلامية فقط ولا تشمل الأخوة في الكلية الجامعية.
* يستثنى منها الطالب اذا حصل على كفالة خارجية وكذلك الطالب نفسه الحاصل على منح داخلية بنسبة 35 % فاكثر.
* يستثنى منها الطالبان اللذان يحصل أحدهما على منحة داخلية أو خارجية أو كفالة بنسبة 50% فأكثر.
* لا تشمل المنحة الطلبة المتزوجين (الذين تم عقد قرانهم) ولا تشمل المنحة (الأب والأم والزوج والزوجة).
لا يقل معدل الطالب في كلية الطب عن 75% للاستفادة من هذه المنحة."
بشرط أن يكون المعدل الفصلي 70%'
        ]);
        Scholarship::create([
            'name' => 'منحة الأسرة (ثلاثة أفراد)',
            'slug' => 'الأسرة 3 أفراد',
            'percent' => '25',
            'status' => '1',
            'internal' => '1',
            'description' => '"* منحة الأسرة تشمل (الأب والأم والأبناء).
* يتم استثناء أفراد العائلة من المنحة في حالة زواج أو عقد قران أحد الأخوة وفي حالة حصول أحد الطلبة على منحة كاملة (داخلية أو خارجية).
* يحصل أفراد الأسرة الأربعة فأكثر على منحة بنسبة 30% لكل طالب تنطبق عليه شروط المنحة وغير مخالف للأحكام العامة.
* في حال مخالفة أحد أفراد الأسرة شروط المنحة، يستثنى الطالب المخالف فقط.
* لا يقل معد الطالب في كلية الطب عن 75% للاستفادة من هذه المنحة. "

بشرط أن يكون المعدل الفصلي 70%'
        ]);
        Scholarship::create([
            'name' => 'منحة الأسرة (أربعة أفراد فأكثر)',
            'slug' => 'الأسرة 4 فأكثر',
            'percent' => '30',
            'status' => '1',
            'internal' => '1',
            'description' => '"* منحة الأسرة تشمل (الأب والأم والأبناء).
* يتم استثناء أفراد العائلة من المنحة في حالة زواج أو عقد قران أحد الأخوة وفي حالة حصول أحد الطلبة على منحة كاملة (داخلية أو خارجية).
* يحصل أفراد الأسرة الأربعة فأكثر على منحة بنسبة 30% لكل طالب تنطبق عليه شروط المنحة وغير مخالف للأحكام العامة.
* في حال مخالفة أحد أفراد الأسرة شروط المنحة، يستثنى الطالب المخالف فقط.
* لا يقل معد الطالب في كلية الطب عن 75% للاستفادة من هذه المنحة. "
بشرط أن يكون المعدل الفصلي 70%'
        ]);
        Scholarship::create([
            'name' => 'منحة أبناء العاملين',
            'slug' => 'منحة أبناء العاملين',
            'percent' => '50',
            'status' => '1',
            'internal' => '1',
            'description' => '"* هذه المنحة تشمل أبناء العاملين بالجامعة الإسلامية أو الكلية الجامعية للعلوم التطبيقية، وكذلك أبناء أعضاء مجلس الأمناء.
* يوقف صرف المنحة إذا تزوج الابن أو البنت.
* يستمر العمل بالمنحة لأبناء الموظفين أو أبناء مجلس الأمناء المتمتعين بهذه المنحة عند تقاعد والديهم حتى ينتهي الابن/البنت الذين يدرسون بالجامعة من دراستهم الجامعية، مع اعتبار جميع مميزات وقيود المنح الأخرى.
* كما تشمل المنحة أبناء الموظفين أو أبناء مجلس الأمناء الملتحقين بالجامعة بعد بلوغ سن التقاعد أو بعد وفاتهم، بحيث تعطى نفس الشروط السابقة وبنسبة 25% فقط.
* لا يقل معدل الطالب في كلية الطب عن (70%) للاستفادة من هذه المنحة."

بشرط أن يكون المعدل الفصلي 65%'
        ]);
        Scholarship::create([
            'name' => 'منحة الطلبة غير الناطقين باللغة العربية (الأجانب)',
            'slug' => 'غير الناطقين باللغة العربية',
            'percent' => '70',
            'status' => '1',
            'internal' => '1',
            'description' => 'تخصص الجامعة الإسلامية عشر منح دراسية للطلبة الأجانب الغير ناطقين باللغة العربية وتعطي الأولوية للأسبق في الالتحاق بشرط أن يكون المعدل الفصلي 80% لاستمرار المنحة'
        ]);

        Scholarship::create([
            'name' => 'منحة الفاخورة',
            'slug' => 'الفاخورة',
            'percent' => '70',
            'status' => '1',
            'internal' => '0',
            'link' => 'https://www.facebook.com/ScholarshipsForPalestinians/posts/10151897637237061/',
            'description' => 'رنامج الفاخورة للمنح الدراسية والتمكين هو برنامج ينفذ من قبل برنامج الأمم المتحدة الإنمائي/برنامج مساعدة الشعب الفلسطيني UNDP/PAPP في الارض الفلسطينية المحتلة، بتمويل من مؤسسة التعليم فوق الجميع بدولة قطر.'
        ]);

        Scholarship::create([
            'name' => 'منحة هاني القدومي',
            'slug' => 'القدومي',
            'percent' => '70',
            'status' => '1',
            'internal' => '0',
            'link' => 'https://www.facebook.com/ScholarshipsForPalestinians/posts/10151897637237061/',
            'description' => 'رنامج الفاخورة للمنح الدراسية والتمكين هو برنامج ينفذ من قبل برنامج الأمم المتحدة الإنمائي/برنامج مساعدة الشعب الفلسطيني UNDP/PAPP في الارض الفلسطينية المحتلة، بتمويل من مؤسسة التعليم فوق الجميع بدولة قطر.'
        ]);
        Scholarship::create([
            'name' => 'منحة أصدقاء الطالب',
            'slug' => 'أصدقاء الطالب',
            'percent' => '70',
            'status' => '1',
            'internal' => '0',
            'link' => 'https://www.facebook.com/ScholarshipsForPalestinians/posts/10151897637237061/',
            'description' => 'رنامج الفاخورة للمنح الدراسية والتمكين هو برنامج ينفذ من قبل برنامج الأمم المتحدة الإنمائي/برنامج مساعدة الشعب الفلسطيني UNDP/PAPP في الارض الفلسطينية المحتلة، بتمويل من مؤسسة التعليم فوق الجميع بدولة قطر.'
        ]);
        Scholarship::create([
            'name' => 'منحة سبيد كليك',
            'slug' => 'سبيدكليك',
            'percent' => '70',
            'status' => '1',
            'internal' => '0',
            'link' => 'https://www.facebook.com/ScholarshipsForPalestinians/posts/10151897637237061/',
            'description' => 'رنامج الفاخورة للمنح الدراسية والتمكين هو برنامج ينفذ من قبل برنامج الأمم المتحدة الإنمائي/برنامج مساعدة الشعب الفلسطيني UNDP/PAPP في الارض الفلسطينية المحتلة، بتمويل من مؤسسة التعليم فوق الجميع بدولة قطر.'
        ]);

    }
}
